#Даны действительные числа x и y. Получить x − y / 1 + xy

a=1
b=2

print(a-b/1+a*b)
