#Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение

NUM1 = 1
NUM2 = 2

print(NUM1 + NUM2)
print(NUM1 - NUM2)
print(NUM1 * NUM2)

