#Даны два действительных числа.
# Найти среднее арифметическое и среднее геометрическое этих чисел

import math
NUM1 = 1
NUM2 = 2
print( (NUM1+NUM2) / 2)

NUM3 = NUM1*NUM2
GEO = math.sqrt(NUM3)
print(GEO)
