#Дано две переменные: строка и буква => "fizbbbuz","b",
# нужно подсчитать сколько раз буква b встречается в заданной строке

A = "fizbbbuz"
B = "b"

print(A.count(B))
