# Создайте такую программу:
# Программа хранит какую-либо цифру в переменной.
# Программа просит пользователя угадать цифру. Пользователь вводит цифру.
# Программа сравнивает цифру с той, что хранится в переменной.
# Если цифры не равны, программа пишет “попробуйте снова” и снова просит пользователя угадать цифру.
# Если пользователь угадывает цифру, программа пишет “Поздравляю! Вы угадали!” и завершается.
# Т.е. программа не завершается пока пользователь не угадает цифру

SECRET_NUMBER = 12
PLAYER = 0
while SECRET_NUMBER != PLAYER:
    PLAYER = int(input('Please, try to guess the secret number:'))
    if SECRET_NUMBER == PLAYER:
        print("Congratulations! It's right number.")
    print("Sorry, no. Try again")
