#Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
import math

a=1
b=2
print((a+b)/2)
num=a*b
geometrical=math.sqrt(num)
print(geometrical)


