#Создайте текстовую переменную с текстом “fermentum”.
# Извлеките из строки первый символ, затем последний, третий с начала и третий с конца.
# Измерьте длину вашей строки.

TEXT = 'fermentum'
TEXT2 = TEXT[0]
print(TEXT2)

TEXT3 = TEXT[-1]
print(TEXT3)

TEXT4 = TEXT[2]
print(TEXT4)

TEXT5 = TEXT[-3]
print(TEXT5)

TEXT6 = len(TEXT)
print(TEXT6)
