#Подсчет букв
#Дано две переменные: строка и буква => "fizbbbuz","b",
# нужно подсчитать сколько раз буква b встречается в заданной строке
#Примеры результатов:
#"Hello there", "e" == 3
#"Hello there", "t" == 1
#"Hello there", "h" == 2
#"Hello there", "L" == 2
#"Hello there", " " == 1

MY_STR = 'fizbbbuz'
B = 'b'
print(MY_STR.count(B))
