# Подсчет букв
# Дано две переменные: строка и буква => "fizbbbuz","b",
# нужно подсчитать сколько раз буква b встречается в заданной строке.

STRING = 'fizbbbuz'
LETTER = 'b'
print(STRING.count(LETTER))
