# Даны действительные числа x и y. Получить x − y / 1 + xy

NUM_X = 8
NUM_Y = 12
NUM_Z = (NUM_X- NUM_Y) / (1 + NUM_X * NUM_Y)
print(NUM_Z)
