# Даны катеты прямоугольного треугольника. Найти его гипотенузу и площадь

a = 6
b = 8

hypotenuse = (a ** 2 + b ** 2) ** 0.5
print(f'Гипотенуза треугольника равна {hypotenuse}')

square = (a * b) / 2
print(f'Площадь треугольника равна {square}')
