# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

a = 84
b = 16

average_arif = (a + b) / 2
print(average_arif)

average_geom = (a * b) ** 0.5
print(average_geom)
