# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = 5
b = 78

print(a + b)
print(a - b)
print(a * b)
