# Даны действительные числа x и y. Получить x − y / 1 + xy

x = 8
y = 12
z = (x - y) / (1 + x * y)
print(z)
