# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

NUM_A = 84
NUM_B = 16

NUM_C = (NUM_A + NUM_B) / 2
print(NUM_C)

NUM_D = (NUM_A * NUM_B) ** 0.5
print(NUM_D)
