# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = 5
b = 78
c = a + b
print(c)
d = a - b
print(d)
e = a * b
print(e)
