"""Внизу решение задачи"""
# Создайте текстовую переменную с текстом “fermentum”. Извлеките из строки первый
# символ, затем последний, третий с начала и третий с конца. Измерьте длину вашей
# строки.
ONE = "fermentum"
TWO = ONE[0]
print(TWO)
THREE = ONE[-1]
print(THREE)
FOUR = ONE[2]
print(FOUR)
FIVE = ONE[-3]
print(FIVE)
SIX = len(ONE)
print(f"Длина строки = {ONE}")

