"""Внизу находится решение задачи"""
# Выведите следующие строки на экран используя цикл while:
# “Попытка №1”
# “Попытка №2”
# “Попытка №3”
# “Попытка №4”
# “Попытка №5”
NUMBER = 1
while NUMBER < 6:
    print(f'Попытка №{NUMBER}')
    NUMBER += 1
