# Создайте текстовую переменную с текстом “fermentum”. Извлеките из строки первый
# символ, затем последний, третий с начала и третий с конца. Измерьте длину вашей
# строки.
ONE = "fermentum"
TWO = (ONE[1:])
THREE = TWO[0:7]
FOUR = THREE.replace('m', '')
FIVE = len(FOUR)
print(f"Длина строки = {FIVE}")
