"""Внизу находится решение задачи"""
# Выведите следующие строки на экран используя цикл for:
# “Попытка №1”
# “Попытка №2”
# “Попытка №3”
# “Попытка №4”
# “Попытка №5”
NUMBERS = [1,2,3,4,5]

for key in NUMBERS:
    print(f'Попытка №{key}')
