# Даны действительные числа x и y. Получить x − y / 1 + xy

X = 10
Y = 20
print("Результат выражения x − y / 1 + xy равно:")
print(X - Y / 1 + X * Y)
