# Даны два действительных числа.
# Найти среднее арифметическое и среднее геометрическое этих чисел

X = 10
Y = 20
print("Среднее арифметическое равно:")
print((X + Y) / 2)
print("Среднее геометрическое равно:")
print((X * Y) ** 0.5)
