# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

A = 10
B = 20
SUM_A_B = A + B
print("Сумма чисел равна:")
print(SUM_A_B)
DIFFERENCE_A_B = A - B
print("Разность чисел равна:")
print(DIFFERENCE_A_B)
MULTIPLICATION_A_B = A * B
print("Произведение чисел равно:")
print(MULTIPLICATION_A_B)
