# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

A = 10
B = 20
print("Сумма чисел равна:")
print(A + B)
print("Разность чисел равна:")
print(A - B)
print("Произведение чисел равно:")
print(A * B)
