# Даны два действительных числа.
# Найти среднее арифметическое и среднее геометрическое этих чисел

X = 10
Y = 20
ARITHMETIC_AVERAGE = (X + Y) / 2
print("Среднее арифметическое равно:")
print(ARITHMETIC_AVERAGE)
GEOMETRIC_AVERAGE = (X * Y) ** 0.5
print("Среднее геометрическое равно:")
print(GEOMETRIC_AVERAGE)
