# Подсчет букв
# Дано две переменные: строка и буква => "fizbbbuz","b",
# нужно подсчитать сколько раз буква b встречается в заданной строке

LETTER = ''
STR = 'fizbbbuz'
print(STR.count(LETTER))
