# Выведите следующие строки на экран используя цикл while:
# “Попытка №1”
# “Попытка №2”
# “Попытка №3”
# “Попытка №4”
# “Попытка №5”

NUM = 1

while NUM < 6:
    print(f'Попытка №{NUM}')
    NUM += 1
