# Создайте текстовую переменную с текстом “fermentum”.
# Извлеките из строки первый символ, затем последний,
# третий с начала и третий с конца. Измерьте длину вашей строки.

MY_STRING = 'fermentum'

MY_STRING1 = MY_STRING[0]
print(MY_STRING1)

MY_STRING2 = MY_STRING[-1]
print(MY_STRING2)

MY_STRING3 = MY_STRING[2]
print(MY_STRING3)

MY_STRING4 = MY_STRING[-3]
print(MY_STRING4)

MY_STRING5 = len(MY_STRING)
print(MY_STRING5)
