# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение
"""С помощью нижеприведенных примеров получаем сумму, разность и произведение чисел"""
NUM_A = 8
NUM_B = 7
print(NUM_A + NUM_B, NUM_A - NUM_B, NUM_A * NUM_B)
