# Даны действительные числа x и y. Получить x − y / 1 + xy
NUM_X = 5
NUM_Y = 2
print(NUM_X - NUM_Y / 1 + (NUM_X * NUM_Y))
