#Даны действительные числа x и y.
# Получить x − y / 1 + xy

NUM1 = 1
NUM2 = 2

print( NUM1-NUM2 / 1+NUM1*NUM2 )
