# Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение.

a = 79
b = 34
print(a + b)
print(a - b)
print(a * b)
