# Даны два действительных числа.
# Найти среднее арифметическое и среднее геометрическое этих чисел.

a = 10
b = 5
c = a + b
print('Среднее арифметическое составляет ' + str(c / 2))
print('Среднее геометрическое составляет ' + str((a * b) ** 0.5))
