# Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение.

A = 79
B = 34
print(A + B)
print(A - B)
print(A * B)
