# Даны действительные числа x и y.
# Получить x − y / 1 + xy.

X = 84
Y = 41
print(X - Y / 1 + X*Y)
