# Даны действительные числа x и y.
# Получить x − y / 1 + xy.

x = 84
y = 41
print(x - y / 1 + x*y)
