# Дaны кaтеты прямоугольного треугольника.
# Найти его гипотенузу и площадь.

A = 4
B = 3
C = (A**2 + B**2) ** 0.5
print('Гипотенуза треугольника равна ' + str(C))
S = A*B / 2
print('Площадь треугольника равна ' + str(S))
