# Даны действительные числа X и Y.
# Получить X − Y / 1 + XY.

X = 84
Y = 41
print(X - Y / 1 + X*Y)
