# Даны катеты прямоугольного треугольника.
# Найти его гипотенузу и площадь.

a = 4
b = 3
c = (4**2 + 3**2) ** 0.5
print('Гипотенуза треугольника равна ' + str(c))
S = a*b / 2
print('Площадь треугольника равна ' + str(S))
