# Даны два действительных числа.
# Найти среднee арифметическое и среднee геометрическое этих чисел.

A = 10
B = 5
C = A + B
print('Среднее арифметическое составляет ' + str(C / 2))
print('Среднее геометрическое составляет ' + str((A * B) ** 0.5))
