# Подсчет букв
# Дано две переменные: строка и буква => "fizbbbuz","b",
# нужно подсчитать сколько раз буква b встречается в заданной строке
"""Внизу решение задания"""
STRING = "fizbbbuz"
NO_STRING = "b"
print(STRING.count(NO_STRING))
