# Напишите программу. Есть 2 переменные salary и bonus. Salary - integer, bonus - boolean.
# Если bonus - true, salary должна быть умножена на 10. Если false - нет
"""Внизу решение задачи"""
SALARY = 50
BONUS = False
if SALARY:
    print((SALARY * 10))
else:
    print(BONUS)
