# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

NUM_A = 5
NUM_B = 7
NUM_C = (NUM_A * NUM_B) ** 0.5

print(f'Среднее арифметическое: {(NUM_A + NUM_B) / 2}')
print(f'Среднее геометрическое: {NUM_C}')
