# Даны действительные числа x и y. Получить x − y / 1 + xy

A = 7
B = 5
print((A - B / 1) + A * B)

