# Даны действительные числа x и y. Получить x − y / 1 + xy

NUM_A = 7
NUM_B = 5
print((NUM_A - NUM_B / 1) + NUM_A * NUM_B)

