#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

NUM_A = 5
NUM_B = 7
print(NUM_A + NUM_B)
print(NUM_A - NUM_B)
print(NUM_A * NUM_B)
