# Напишите программу. Есть 2 переменные salary и bonus.
# Salary - integer, bonus - boolean.
# Если bonus - true, salary должна быть умножена на 10. Если false - нет

salary = 168998
bonus = False

if bonus:
    print(salary * 10)
else:
    print(salary)
