# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

A = 11
B = 22

C = A + B
V = A - B
F = A * B

<<<<<<< HEAD
print(f"Суммы переменных a и b равна: {C} \nРазности переменных a и b равна: {V} \nПроизведение переменных a и b "
      f"равна: {F} \n")
=======
print(f"Суммы переменных a и b равна: {C} \nРазности переменных a и b равна: {V} "
      f"\nПроизведение переменных a и b 1равна: {F} \n")
>>>>>>> aad82236993b8cfbdec920f73883c6495d1a461b
