# Даны действительные числа x и y. Получить x − y / 1 + xy

X = 11.1
Y = 22

G = X - Y / 1 + X * Y

print(f"Результат: {G}")
