# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

A = 11
B = 22

C = A + B
V = A - B
F = A * B

print(f"Суммы переменных a и b равна: {C} \nРазности переменных a и b равна: {V} \nПроизведение переменных a и b "
      f"равна: {F} \n")
