# Даны два действительных числа.
# Найти среднее арифметическое и среднее геометрическое этих чисел

X = 11
Y = 22

Q = (X + Y) / 2
W = (X * Y) ** 0.5

print(f"Среднее арифметическое равно: {Q} \nСреднее геометрическое равно: {W}")
